In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from matplotlib import style
import numpy as np
style.use('ggplot')

In [35]:
import json
import codecs
from os import listdir

In [5]:
with codecs.open('./data/DRID_2016_5k.json','r','utf-8') as f:
    data = f.read()

In [6]:
len(data)

702694

In [7]:
dublin5k = json.loads(data)

In [9]:
print(type(dublin5k))

<class 'dict'>

In [15]:
print(dublin5k['data'][0])

{'first_name': 'Richard', 'last_name': 'OWENS', 'club': 'Clonliffe Harriers', 'chip_time': '00:16:04', 'gender': 'Male', 'finish_time': '00:16:06', 'gender_pos': '1', 'bib': '8609', 'rank': '1'}

In [20]:
dfDublin5k = pd.DataFrame(dublin5k['data'][0], index=[0])

In [22]:
for i in range(1, len(dublin5k['data'])):
    dfDublin5k.append(dublin5k['data'][i], ignore_index=True)

In [23]:
dfDublin5k.head()

,bib,chip_time,club,finish_time,first_name,gender,gender_pos,last_name,rank
0,8609,00:16:04,Clonliffe Harriers,00:16:06,Richard,Male,1,OWENS,1

In [25]:
pd.read_json(data,orient='index')

,0,1,2,3,4,5,6,7,8,9,...,4126,4127,4128,4129,4130,4131,4132,4133,4134,4135
data,"{'first_name': 'Richard', 'last_name': 'OWENS'...","{'first_name': 'Conor', 'last_name': 'MCGUINNE...","{'first_name': 'Vincent', 'last_name': 'MCGUIN...","{'first_name': 'Ben', 'last_name': 'MCDONALD',...","{'first_name': 'Jamie', 'last_name': 'GAHAN', ...","{'first_name': 'Eoghan', 'last_name': 'KEANEY'...","{'first_name': 'Patrick', 'last_name': 'COYLE'...","{'first_name': 'Hannah', 'last_name': 'LINNEY'...","{'first_name': 'Padraig', 'last_name': 'MAHONY...","{'first_name': 'Rob', 'last_name': 'DEVLIN', '...",...,"{'first_name': 'Sasha', 'last_name': 'WILSON',...","{'first_name': 'Padraic', 'last_name': 'MULDOO...","{'first_name': 'Mary', 'last_name': 'O'NEILL',...","{'first_name': 'Fiona', 'last_name': 'O'HARA',...","{'first_name': 'Angela', 'last_name': 'ROCHE',...","{'first_name': 'Elaine', 'last_name': 'MAHER',...","{'first_name': 'Sarah', 'last_name': 'LOUGHMAN...","{'first_name': 'Naomi', 'last_name': 'BYRNE', ...","{'first_name': 'Gillian', 'last_name': 'WHELAN...","{'first_name': 'Lisa', 'last_name': 'CLINCH', ..."

In [28]:
data[0:8]

'{"data":'

In [31]:
data[-1:]

'}'

In [33]:
dfDublin5k = pd.read_json(data[8:-1])

In [34]:
dfDublin5k.head()

,bib,chip_time,club,finish_time,first_name,gender,gender_pos,last_name,rank
0,8609,00:16:04,Clonliffe Harriers,2016-11-17 00:16:06,Richard,Male,1,OWENS,1
1,6263,00:16:28,None,2016-11-17 00:16:31,Conor,Male,2,MCGUINNESS,2
2,5055,00:16:47,Ammeonians,2016-11-17 00:16:49,Vincent,Male,3,MCGUINNESS,3
3,4685,00:17:14,None,2016-11-17 00:17:23,Ben,Male,4,MCDONALD,4
4,8419,00:17:58,None,2016-11-17 00:18:05,Jamie,Male,5,GAHAN,5

In [36]:
listdir('./data')

['BelfastRID_2012_10k.json',
 'BelfastRID_2012_5k.json',
 'BelfastRID_2013_10k.json',
 'BelfastRID_2013_5k.json',
 'BelfastRID_2014_10k.json',
 'BelfastRID_2014_5k.json',
 'BelfastRID_2015_10k.json',
 'BelfastRID_2015_5k.json',
 'BelfastRID_2016_10k.json',
 'BelfastRID_2016_5k.json',
 'CorkRID_2012_10k.json',
 'CorkRID_2012_5k.json',
 'CorkRID_2013_10k.json',
 'CorkRID_2013_5k.json',
 'CorkRID_2014_10k.json',
 'CorkRID_2014_5k.json',
 'CorkRID_2015_10k.json',
 'CorkRID_2015_5k.json',
 'CorkRID_2016_10k.json',
 'CorkRID_2016_5k.json',
 'DRID_2012_10k.json',
 'DRID_2012_5k.json',
 'DRID_2013_10k.json',
 'DRID_2013_5k.json',
 'DRID_2014_10k.json',
 'DRID_2014_5k.json',
 'DRID_2015_10k.json',
 'DRID_2015_5k.json',
 'DRID_2016_10k.json',
 'DRID_2016_5k.json',
 'LondonRID_2012_10k.json',
 'LondonRID_2012_5k.json',
 'LondonRID_2013_10k.json',
 'LondonRID_2013_5k.json',
 'LondonRID_2014_10k.json',
 'LondonRID_2014_5k.json',
 'LondonRID_2015_10k.json',
 'LondonRID_2015_5k.json',
 'LondonRID_2016_10k.json',
 'LondonRID_2016_5k.json',
 'ManchesterRID_2013_10k.json',
 'ManchesterRID_2013_5k.json',
 'ManchesterRID_2014_10k.json',
 'ManchesterRID_2014_5k.json',
 'ManchesterRID_2015_10k.json',
 'ManchesterRID_2015_5k.json',
 'ManchesterRID_2016_10k.json',
 'ManchesterRID_2016_5k.json']